app/controllers/api/construction_drawings_controller.rb

SELECT "construction_drawings".* FROM "construction_drawings" ORDER BY "construction_drawings"."discipline" DESC
---
    def get_matching_cds(search_term)
      if search_term.blank?
        ConstructionDrawing.all.order(discipline: "ASC")