app/controllers/api/construction_drawings_controller.rb

    def create
      discipline_code = params[:discipline][/\(.*\)/]
      puts discipline_code
      cd = ConstructionDrawing.where(discipline: params[:discipline]).count
      cd += 1
      @num_seq = cd.to_s.rjust(4,'0')
      @doc_num = 'PROJ-' + params[:register] + '-'  + discipline_code&.gsub("[()]", "").to_s + '-' +@num_seq +  '-' + params[:revision_number]

      file = Cloudinary::Uploader.upload(params[:attachments], :folder => "Construkt/shop_drawings/", :public_id => @doc_num,)


      @construction_drawing = ConstructionDrawing.create!(
          document_number: @doc_num,
          document_status: params[:document_status],
          subject: params[:subject],
          remarks: params[:remarks],
          register: params[:register],
          location: params[:location],
          revision_number: params[:revision_number].to_i,
          discipline: params[:discipline],
          company_from: params[:company_from],
          published_by: params[:published_by],
          published_by_id: current_user.id,
          # created_at: params[:created_at],
          attachments: file["url"],

      )
---
SELECT COUNT(*) FROM "construction_drawings" WHERE "construction_drawings"."discipline" = $1  [["discipline", "Traffic Engineering(TE)"]]
INSERT INTO "construction_drawings" ("register", "discipline", "location", "document_status", "package", "published_by", "published_by_id", "subject", "company_to", "company_from", "created_at", "updated_at", "document_number", "revision_number", "attachments", "remarks") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

    def show
      cd_drawing = ConstructionDrawing.where(document_number: params[:id])
---
SELECT "construction_drawings".* FROM "construction_drawings" WHERE (document_number LIKE '%c%' OR subject LIKE '%c%' OR discipline LIKE '%c%' OR document_status LIKE '%c%' OR published_by LIKE '%c%')