app/controllers/api/users_controller.rb

    def index
      matching_users = get_matching_users(params["search_term"])

      users = User.all.order(created_at: "DESC").map do |user|
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

    def get_matching_users(search_term)
      if search_term.blank?
        User.all.order(created_at: "DESC")
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC