app/controllers/api/users_controller.rb

    def index
      # users = User.all.order(updated_at: "DESC").map do |user|
      users = get_matching_users(params["search_term"]).map do |user|
        {
          id: user.id,
          email: user.email,
          first_name: user.first_name,
          last_name: user.last_name,
          role: user.role,
          company: user.company_name,
          package: user.package,
          created: user.created_at.strftime("%B %d, %Y"),
          last_updated: user.updated_at.strftime("%B %d, %Y"),
          open_items: user.open_items_count
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "first_name", "last_name", "role", "company_name", "package", "open_items_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def create
      User.create!(
        first_name: params[:first_name],
        last_name: params[:last_name],
        email: params[:email],
        password: params[:password],
        role: params[:role],
        company_name: params[:company],
        package: params[:package]
      )
---
INSERT INTO "users" ("integer_id", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "first_name", "last_name", "role", "company_name", "package", "open_items_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

    def edit
      puts params
      user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "5e664c35-9b1e-4f93-b82f-c216d6d013a5"], ["LIMIT", 1]]

    def update
      user = User.find(params[:id])
      user.update!(
      first_name: params[:first_name],
      last_name: params[:last_name],
      email: params[:email],
      password: params[:password],
      role: params[:role],
      company_name: params[:company],
      package: params[:package]
    )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "5e664c35-9b1e-4f93-b82f-c216d6d013a5"], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2, "first_name" = $3 WHERE "users"."id" = $4  [["encrypted_password", "[FILTERED]"], ["updated_at", "2022-09-27 19:02:26.429323"], ["first_name", "Abes"], ["id", "5e664c35-9b1e-4f93-b82f-c216d6d013a5"]]

    def destroy
      user = User.find(params[:id])
      user.destroy!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "185f783c-0f40-42d0-9e83-367dd17b2ff8"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", "185f783c-0f40-42d0-9e83-367dd17b2ff8"]]

    def get_user
      puts params
      user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "c96e0972-9a00-4a5e-b124-c31983288e8d"], ["LIMIT", 1]]